/*
 * bValidator Arabic (ar) error messages by hoodpear@gmail.com
 */

bValidator.defaultOptions.messages.ar = {
  'default' : 'الرجاء تصحيح قيمة هذا الحقل.',
  minlen    : 'يجب أن يحتوي هذا الحقل على {0} حرف على الأقل.',
  maxlen    : 'يجب أن يحتوي هذا الحقل على {0} من الأحرف كحد أقصى.',
  rangelen  : 'يجب أن يحتوي هذا الحقل على ما بين {0} و {1} حرف.',
  min       : 'يجب أن تكون هذه القيمة أكبر من أو تساوي {0}.',
  max       : 'يجب أن تكون هذه القيمة أقل من أو تساوي {0}.',
  between   : 'أدخل رقمًا بين {0} و {1}.',
  required  : 'الرجاء إكمال هذا الحقل.',
  alpha     : 'تقبل الحروف فقط.',
  alphanum  : 'استخدم الأحرف الأبجدية الرقمية فقط.',
  digit     : 'يتم قبول الأرقام فقط.',
  number    : 'الرجاء إدخال رقم.',
  email     : 'رجاء قم بإدخال بريد الكتروني صحيح.',
  url       : 'أدخل رابط صحيح من فضلك.',
  ip4       : 'يرجى تقديم عنوان IPv4 صالح.',
  ip6       : 'يرجى تقديم عنوان IPv6 صالح.',
  date      : 'يجب إدخال تاريخ صالح بالتنسيق {0}',
  equal     : 'من فظلك ادخل نفس القيمة مرة أخرى.',
  differ    : 'الرجاء إدخال قيمة أخرى.'
};

bValidator.defaultOptions.lang = 'ar';